#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/CrimLog/dev/runs/run-RWAwi5vpHEHh3d55

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.aws_acm_certificate.cert: Refreshing...
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/ecs/graphql-api-dev]
aws_iam_policy.fargate_policy: Refreshing state... [id=arn:aws:iam::043894507808:policy/graphql-api-dev-fargate-policy]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=graphql-api-dev-execution-role]
aws_default_vpc.vpc: Refreshing state... [id=vpc-0d6048d87526ca2aa]
aws_vpc.vpc: Refreshing state... [id=vpc-0dd1abc04eb78546a]
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:043894507808:cluster/graphql-api-dev]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment2: Refreshing state... [id=graphql-api-dev-execution-role-20230428144451372400000001]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment1: Refreshing state... [id=graphql-api-dev-execution-role-20230428144451387600000002]
aws_ecs_task_definition.definition: Refreshing state... [id=graphql-api-dev-task]
data.aws_acm_certificate.cert: Refresh complete after 0s [id=arn:aws:acm:us-east-1:043894507808:certificate/bf306bea-c739-451e-bc54-bfd24909b37c]
aws_vpc_peering_connection.peering_connection: Refreshing state... [id=pcx-02ca43ff46d27f622]
aws_internet_gateway.gw: Refreshing state... [id=igw-0f722e2ec075b406a]
aws_subnet.subnet["us-east-1d"]: Refreshing state... [id=subnet-0699b39f84d929a68]
aws_subnet.subnet["us-east-1b"]: Refreshing state... [id=subnet-068e99669610bf988]
aws_security_group.web_everyone2: Refreshing state... [id=sg-0ceb37cfb20b50043]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:043894507808:targetgroup/graphql-api-dev/83e131544a9b44d8]
aws_default_security_group.default: Refreshing state... [id=sg-061747dff8a994e8b]
aws_security_group.graphql_api: Refreshing state... [id=sg-0cead3059c486959e]
aws_route.vpc_peering_route: Refreshing state... [id=r-rtb-09b02ae3a536a3f7a2811395018]
aws_default_route_table.default: Refreshing state... [id=rtb-0209f8b11e4513cc2]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:043894507808:loadbalancer/app/graphql-api-dev-alb/252731848262f1ac]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:043894507808:service/graphql-api-dev/graphql-api-dev-svc]
aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:043894507808:listener/app/graphql-api-dev-alb/252731848262f1ac/cee2a346a2c2a344]
aws_ecs_service.service: Drift detected (update)
aws_lb.alb: Drift detected (update)
aws_lb_target_group.target_group: Drift detected (update)
aws_iam_policy.fargate_policy: Drift detected (update)
aws_cloudwatch_log_group.log_group: Drift detected (update)
aws_lb_listener.listener: Drift detected (update)
aws_default_vpc.vpc: Drift detected (update)
aws_iam_role.ecs_task_execution_role: Drift detected (update)
aws_ecs_task_definition.definition: Drift detected (update)
aws_ecs_cluster.cluster: Drift detected (update)
aws_subnet.subnet["us-east-1b"]: Drift detected (update)
aws_subnet.subnet["us-east-1d"]: Drift detected (update)
aws_default_route_table.default: Drift detected (update)
aws_security_group.graphql_api: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:043894507808:service/graphql-api-dev/graphql-api-dev-svc"
        name                               = "graphql-api-dev-svc"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:043894507808:task-definition/graphql-api-dev-task:3" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.definition must be replaced
-/+ resource "aws_ecs_task_definition" "definition" {
      ~ arn                      = "arn:aws:ecs:us-east-1:043894507808:task-definition/graphql-api-dev-task:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:043894507808:task-definition/graphql-api-dev-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "043894507808.dkr.ecr.us-east-1.amazonaws.com/graphql-api:ea0cbb6f1af2b62f18d904183442047872313923" -> "043894507808.dkr.ecr.us-east-1.amazonaws.com/graphql-api:30a03735aaf896593d12c9b1045627ae42d39237"
                    name             = "graphql-api-dev-container"
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "graphql-api-dev-task" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`, Environment: `dev`*